app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = ?  [["user_id", 1]]
---

												<% if current_user != nil && !current_user.events.include?(event) &&current_user.student? %>