app/views/welcome/index.html.erb

SELECT "organizations".* FROM "organizations" INNER JOIN "organizations_users" ON "organizations"."id" = "organizations_users"."organization_id" WHERE "organizations_users"."user_id" = ?  [["user_id", 1]]
---

							<% if user_signed_in? && current_user.organizations.length > 0 %>

SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ?  [["event_id", 1]]
SELECT  "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ? LIMIT 5  [["event_id", 1]]
---
														 	<li><i class="fa fa-facebook-square fa-2x"></i></li>
														 	<li><%= event.users.size %><li>
														 	<% event.users.limit(5).each do |user| %>

SELECT  1 AS one FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = ? AND "events"."id" = 1 LIMIT 1  [["user_id", 1]]
---

												<% if current_user != nil && !current_user.events.include?(event) &&current_user.student? %>