app/controllers/events_controller.rb

INSERT INTO "events" ("categories", "created_at", "date", "description", "location", "off_campus", "organization_id", "title", "transportation_details", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)


    respond_to do |format|
      if @event.save

SELECT  "organizations".* FROM "organizations" INNER JOIN "organizations_users" ON "organizations"."id" = "organizations_users"."organization_id" WHERE "organizations_users"."user_id" = ?  ORDER BY "organizations"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT COUNT(*) FROM "organizations" INNER JOIN "organizations_users" ON "organizations"."id" = "organizations_users"."organization_id" WHERE "organizations_users"."user_id" = ?  [["user_id", 1]]
---
    def set_new_event_path
          if !user_signed_in?
            redirect_to root_path(:sign_up => :true)
          elsif current_user.organizations.size == 0