app/controllers/organizations_controller.rb

INSERT INTO "organizations" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-09-29 02:20:19.021453"], ["description", "Campusfly"], ["name", "CampusFly"], ["updated_at", "2015-09-29 02:20:19.021453"]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save
        format.html { redirect_to @organization, notice: 'Organization was successfully created.' }
        format.json { render :show, status: :created, location: @organization }
      else
        format.html { render :new }
        format.json { render json: @organization.errors, status: :unprocessable_entity }
      end
    end
    @organization.users << User.find(params['creator_id'].to_i)