app/controllers/welcome_controller.rb

  def index
    @events = Event.all.sort_by{|event| event.date}
---
SELECT "events".* FROM "events"